const serviceTerms = `제 1 조 (목적)
이 약관은 (주)아이스크림미디어(이하 '회사'라 함)의 아이스크림( www.i-scream.co.kr )에서 제공하는 교육 정보서비스 (이하 '서비스'라 함)의 이용과 관련하여 회사와 회원 사이에 권리 의무 및 책임사항 등을 규정함을 목적으로 합니다.

제 2 조 (정의)
본 약관에서 사용하는 용어의 정의는 다음과 같습니다.

1. '회사'는 콘텐츠 및 제반 서비스를 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 이를 거래할 수 있도록 설정한 영업장을 말합니다.
2. 이용자는 회사의 웹사이트에 접속하여 본 약관에 따라 회사가 제공하는 '콘텐츠' 및 제반 서비스를 이용하는 '교사인증회원', '미인증 회원'을 의미합니다.
3. 회원은 회사와 서비스 이용에 관한 계약 또는 이용 약관에 동의한 후 ID를 부여 받은 자를 의미합니다.
4. 회사가 정하는 각 회원의 규정은 다음과 같습니다.
1) 인증 회원 : 회원가입 후 교사인증을 받고 아이스크림을 무료로 이용하는 회원
2) 미인증 회원 : 회원가입 후 교사인증을 받지 않고 아이스크림 이용이 불가능한 회원
5. '제휴 사이트'란 '회사'에서 운영하고 있는 사이트를 의미하며, 회원으로 등록한 이용자가 다양한 정보와 서비스를 제공받을 수 있도록 제작, 운영하는 사이트를 의미합니다. ※아이스크림미디어 제휴 사이트 현황"아이스크림원격교육연수원", "아이스크림몰", "쌤튜브", "쌤블로그", "띵커벨", "하이클래스", "아이스크림교과서", "클래스툴"
6. 미인증 회원에 대해 회사는 교사가 아닌 것으로 간주하여 콘텐츠 이용에 제한을 줄 수 있습니다.
7. 아이디(ID)는 회원 식별과 회원의 서비스 이용을 위하여 이용계약 체결 시 회원의 선택으로 회사가 승인하는 문자와 숫자의 조합을 의미합니다.
8. 콘텐츠(Contents)는 아이스크림 웹사이트에서 제공하는 온라인교수자료 및 기타 관련정보를 의미합니다.
9. 비밀번호(Password)는 회원이 자신의 비밀을 보호하기 위해 선정한 문자와 숫자의 조합을 의미합니다.
     비밀번호는 아이디와 동일해서는 안됩니다.
10. 해지는 회원이 서비스 이용 후 그 이용계약을 종료시키는 의사표시를 의미합니다.
11. 운영자(관리자)는 서비스의 전반적인 관리와 원활한 운영을 위하여 회사에서 선정한 사람 또는 회사를 말합니다.
12. 전자우편(Email)은 인터넷을 통한 우편 혹은 매체를 이용한 우편을 의미합니다.
13. 회원의 게시물은 회사의 서비스가 제공되는 웹사이트에 회원이 올린 글, 이미지, 각종 파일 및 링크, 각종 댓글 등의 정보를 말합니다.`;

const privacyTerms = `
㈜아이스크림미디어가 운영하는 아이스크림(www.i-scream.co.kr)에서 취급하는 이용자의 모든 개인정보는 관련법령에 근거하거나 이용자의 동의 하에 수집, 보유 및 처리, 관리 되고 있습니다. [개인정보 보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률]은 이러한 개인정보처리에 대한 일반적인 규범을 제시하고 있으며, ㈜아이스크림미디어 아이스크림(이하 회사)에서는 이러한 법령의 규정에 따라 수집, 보유 및 처리, 관리하는 개인정보를 이용약관에 명시한 목적 이외의 용도로는 절대 사용하지 않을 것이며, 외부 유출이 되지 않도록 다음과 같이 개인정보처리방침을 운영하고 있습니다.

1. 개인정보의 처리 목적, 수집 항목, 보유 및 이용 기간

1) 아이스크림(i-Scream)은 정보통신망 이용촉진 및 정보보호 등에 관한 법률에 의거하여 이용자의 개인 정보를 보호하고 원활하고 안전한 서비스를 제공하는데 목적이 있습니다. 

2) 아이스크림은 이용자의 신분을 확인하고 개인의 특성에 맞춰 문의 및 상담 등 광범위한 서비스 제공에 대해 명확하고 신속하게 대처하고자 합니다.

3) 자동으로 수집·저장되는 개인정보 : 이용자의 인터넷 서버 도메인과 홈페이지를 방문할 때 거친 웹사이트 주소, 브라우저 종류, OS, 방문 일시, IP (자동 수집·저장되는 정보는 원활한 서비스를 위해 통계분석 등에 이용 될 수 있습니다.)

4) 수집방법 : 홈페이지 또는 모바일 어플리케이션, 서면양식, 팩스, 전화, 상담 게시판, 이메일, 또는 협력사가 개최하는 각종 이벤트나 공모전에서 동의를 구하고 최소한의 정보 수집

5) 개인정보의 보유 및 이용 기간 : 아이스크림의 서비스를 이용하는 이용자로 있는 동안 개인정보를 보유하며, 탈퇴 시 파기합니다. 단, 필요에 따라 회사의 중대 손실 예방, 범죄 및 소송 등을 위해 최소한의 개인정보 항목을 탈퇴자의 동의를 받고 보유할 수 있으며 기타 법령의 규정에 따라 보존할 수 있습니다.

(1) 관련법령에 의한 정보보유 사유
      ① 『전자상거래 등에서의 소비자 보호에 관한 법률』에 따른 표시·광고, 계약내용 및 이행 거래에 관한 기록          - 표시·광고에 관한 기록 : 6개월           - 계약 또는 청약철회 등에 관한 기록 : 5년         - 계약 또는 청약철회, 대금결제, 재화 등의 공급에 관한 기록 : 5년         - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
      ② 『통신비밀보호법』에 따른 통신사실확인자료 보관         - 가입자 전기통신일시, 개시·종료기간, 상대방 가입자번호, 사용도수, 발신기지국 위치추적자료 : 1년         - 컴퓨터 통신, 인터넷 로그기록자료, 접속지 추적자료 : 1년         - 본인 확인에 관한 기록 : 3개월
      `;

const personalTerms = `
아이스크림미디어는 아래의 목적으로 개인정보를 수집 및 이용하며, 개인정보를 안전하게 취급하는데 최선을 다합니다.

목적 : 제휴/문의에 따른 연락처 정보 확인
항목 : 회사(기관)명. 작성자명, 연락처, 이메일
보유기간 : 내용의 검토 및 상담을 위해 등록 후 90일간 보관하며, 이후 해당 정보를 지체없이 파기합니다. 단, 제휴/문의의 기각 및 거절시에는 해당 정보를 즉시 파기합니다.`;

let data = [
  {
    termsId: 3,
    detail: serviceTerms,
    startDate: new Date('2024-06-21').toISOString()
  },
  {
    termsId: 2,
    detail: serviceTerms,
    startDate: new Date('2024-06-20').toISOString()
  },
  {
    termsId: 1,
    detail: serviceTerms,
    startDate: new Date('2024-06-19').toISOString()
  }
];

let data2 = [
  {
    termsId: 3,
    detail: privacyTerms,
    startDate: new Date('2024-06-21').toISOString()
  },
  {
    termsId: 2,
    detail: privacyTerms,
    startDate: new Date('2024-06-20').toISOString()
  },
  {
    termsId: 1,
    detail: privacyTerms,
    startDate: new Date('2024-06-19').toISOString()
  }
];

let data3 = [
  {
    termsId: 3,
    detail: personalTerms,
    startDate: new Date('2024-06-21').toISOString()
  },
  {
    termsId: 2,
    detail: personalTerms,
    startDate: new Date('2024-06-20').toISOString()
  },
  {
    termsId: 1,
    detail: personalTerms,
    startDate: new Date('2024-06-19').toISOString()
  }
];

export default defineEventHandler(async event => {
  const { termsType } = getQuery(event);

  if (event.req.method === 'GET') {
    return {
      success: true,
      code: '',
      message: '',
      responseTime: 0,
      errors: {},
      data: termsType === 'U' ? data : termsType === 'P' ? data2 : data3
    };
  }
});
