let data = [
  {
    noticeId: 1,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 2,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 3,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 4,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 5,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 6,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 7,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 8,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 9,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  },
  {
    noticeId: 10,
    title: '아이스크림미디어의 새로운 소식을 알립니다.',
    createdDate: new Date(),
    detail:
      '아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.'
  }
];

export default defineEventHandler(async event => {
  if (event.req.method === 'GET') {
    return {
      success: true,
      code: '',
      message: '',
      responseTime: 0,
      paginationInfo: {},
      errors: {},
      data,
      totalPages: 10
    };
  }
});
