<script setup>
definePageMeta({
  layout: 'default'
});
</script>

<script>
export default {
  data() {
    return {
      model: '[현행] 2024. 05. 02'
    };
  }
};
</script>

<template>
  <UiTitle>
    <h2>이용약관</h2>
    <UiSelect hide-details width="240" v-model="model" :items="['[현행] 2024. 05. 02']" />
  </UiTitle>
  <UiSection class="lined type-pre">
    <!-- TODO : 이용약관 관리자에 저장된 내용이 들어갑니다. -->
    <div>
      <strong>제 1 조 (목적)</strong>
      <p>
        이 약관은 (주)아이스크림미디어(이하 '회사'라 함)의 아이스크림( www.i-scream.co.kr )에서 제공하는 교육 정보서비스 (이하 '서비스'라
        함)의 이용과 관련하여 회사와 회원 사이에 권리 의무 및 책임사항 등을 규정함을 목적으로 합니다.
      </p>
    </div>
    <div>
      <strong>제 2 조 (정의)</strong>
      <p>본 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
      <ol>
        <li>
          '회사'는 콘텐츠 및 제반 서비스를 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 이를 거래할 수 있도록 설정한
          영업장을 말합니다.
        </li>
        <li>
          용자는 회사의 웹사이트에 접속하여 본 약관에 따라 회사가 제공하는 '콘텐츠' 및 제반 서비스를 이용하는 '교사인증회원', '미인증
          회원'을 의미합니다.
        </li>
        <li>회원은 회사와 서비스 이용에 관한 계약 또는 이용 약관에 동의한 후 ID를 부여 받은 자를 의미합니다.</li>
        <li>
          회사가 정하는 각 회원의 규정은 다음과 같습니다.
          <ol>
            <li>인증 회원 : 회원가입 후 교사인증을 받고 아이스크림을 무료로 이용하는 회원</li>
            <li>미인증 회원 : 회원가입 후 교사인증을 받지 않고 아이스크림 이용이 불가능한 회원</li>
          </ol>
        </li>
        <li>
          '제휴 사이트'란 '회사'에서 운영하고 있는 사이트를 의미하며, 회원으로 등록한 이용자가 다양한 정보와 서비스를 제공받을 수 있도록
          제작, 운영하는 사이트를 의미합니다. ※아이스크림미디어 제휴 사이트 현황"아이스크림원격교육연수원", "아이스크림몰", "쌤튜브",
          "쌤블로그", "띵커벨", "하이클래스", "아이스크림교과서", "클래스툴"
        </li>
        <li>미인증 회원에 대해 회사는 교사가 아닌 것으로 간주하여 콘텐츠 이용에 제한을 줄 수 있습니다.</li>
        <li>
          아이디(ID)는 회원 식별과 회원의 서비스 이용을 위하여 이용계약 체결 시 회원의 선택으로 회사가 승인하는 문자와 숫자의 조합을
          의미합니다.
        </li>
        <li>콘텐츠(Contents)는 아이스크림 웹사이트에서 제공하는 온라인교수자료 및 기타 관련정보를 의미합니다.</li>
        <li>
          비밀번호(Password)는 회원이 자신의 비밀을 보호하기 위해 선정한 문자와 숫자의 조합을 의미합니다. 비밀번호는 아이디와 동일해서는
          안됩니다.
        </li>
        <li>해지는 회원이 서비스 이용 후 그 이용계약을 종료시키는 의사표시를 의미합니다.</li>
        <li>운영자(관리자)는 서비스의 전반적인 관리와 원활한 운영을 위하여 회사에서 선정한 사람 또는 회사를 말합니다.</li>
        <li>전자우편(Email)은 인터넷을 통한 우편 혹은 매체를 이용한 우편을 의미합니다.</li>
        <li>
          회원의 게시물은 회사의 서비스가 제공되는 웹사이트에 회원이 올린 글, 이미지, 각종 파일 및 링크, 각종 댓글 등의 정보를 말합니다.
        </li>
      </ol>
    </div>
  </UiSection>
</template>

<style lang="scss">
@import url(@/assets/scss/pages/cs.scss);
</style>
