<script setup>
definePageMeta({
  layout: 'default'
});
// TOO layout 파일에 title, desc 를 보내줘서 UiPageTitle에 값으로 넣고 싶어요.
</script>

<template>
  <UiTitle>
    <h2>자주하는 질문</h2>
  </UiTitle>
  <UiAccordion class="type-qna">
    <!-- 1/2 데이터 없는 경우 -->
    <UiNoData />
    <!-- 2/2 데이터 있는 경우 -->
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        자주하는 질문을 등록합니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기
        버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가
        노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이
        노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의
        새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기
        버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem
      title="질문이 들어갑니다. 긴글 테스트 Et no ut rebum eirmod est lorem dolore. Sit amet et lorem accusam, ipsum eos duo sed clita eirmod dolor. Takimata labore sed sea amet labore tempor ut, amet justo et amet et clita no. Clita sed et sed duo, invidunt dolor amet amet justo eirmod eos et. Consetetur ea."
    >
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
    <UiAccordionItem title="질문이 들어갑니다. 질문이 들어갑니다. ">
      <p>
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시
        10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다. 아이스크림미디어의 새로운 소식을 알립니다. 최초
        10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이 없는 경우 더보기 버튼은 노출되지 않습니다.
        아이스크림미디어의 새로운 소식을 알립니다. 최초 10개의 글이 노출되며 더보기 버튼 클릭 시 10개씩 추가 노출됩니다. 불러올 게시글이
        없는 경우 더보기 버튼은 노출되지 않습니다.
      </p>
    </UiAccordionItem>
  </UiAccordion>
  <UiPageBtn>
    <UiBtn class="btn-primary" size="large" append-icon="iconPlus">더보기</UiBtn>
  </UiPageBtn>
</template>

<style lang="scss">
@import url(@/assets/scss/pages/cs.scss);
</style>
