<script setup>
definePageMeta({
  layout: 'default'
});
</script>

<script>
export default {
  data() {
    return {
      model: '[현행] 2024. 05. 02'
    };
  }
};
</script>

<template>
  <UiTitle>
    <h2>개인정보처리방침</h2>
    <UiSelect hide-details width="240" v-model="model" :items="['[현행] 2024. 05. 02']" />
  </UiTitle>
  <UiSection class="lined type-pre">
    <!-- TODO : 개인정보처리방침 관리자에 저장된 내용이 들어갑니다. -->
    <div>
      ㈜아이스크림미디어가 운영하는 아이스크림(www.i-scream.co.kr)에서 취급하는 이용자의 모든 개인정보는 관련법령에 근거하거나 이용자의 동의
      하에 수집, 보유 및 처리, 관리 되고 있습니다. [개인정보 보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률]은 이러한 개인정보처리에
      대한 일반적인 규범을 제시하고 있으며, ㈜아이스크림미디어 아이스크림(이하 회사)에서는 이러한 법령의 규정에 따라 수집, 보유 및 처리,
      관리하는 개인정보를 이용약관에 명시한 목적 이외의 용도로는 절대 사용하지 않을 것이며, 외부 유출이 되지 않도록 다음과 같이
      개인정보처리방침을 운영하고 있습니다.
    </div>
    <div>1. 개인정보의 처리 목적, 수집 항목, 보유 및 이용 기간</div>
    <div>
      1) 아이스크림(i-Scream)은 정보통신망 이용촉진 및 정보보호 등에 관한 법률에 의거하여 이용자의 개인 정보를 보호하고 원활하고 안전한
      서비스를 제공하는데 목적이 있습니다.
    </div>
    <div>
      2) 아이스크림은 이용자의 신분을 확인하고 개인의 특성에 맞춰 문의 및 상담 등 광범위한 서비스 제공에 대해 명확하고 신속하게 대처하고자
      합니다.
    </div>
    <div>
      3) 자동으로 수집·저장되는 개인정보 : 이용자의 인터넷 서버 도메인과 홈페이지를 방문할 때 거친 웹사이트 주소, 브라우저 종류, OS, 방문
      일시, IP (자동 수집·저장되는 정보는 원활한 서비스를 위해 통계분석 등에 이용 될 수 있습니다.)
    </div>
    <div>
      4) 수집방법 : 홈페이지 또는 모바일 어플리케이션, 서면양식, 팩스, 전화, 상담 게시판, 이메일, 또는 협력사가 개최하는 각종 이벤트나
      공모전에서 동의를 구하고 최소한의 정보 수집
    </div>
    <div>
      5) 개인정보의 보유 및 이용 기간 : 아이스크림의 서비스를 이용하는 이용자로 있는 동안 개인정보를 보유하며, 탈퇴 시 파기합니다. 단,
      필요에 따라 회사의 중대 손실 예방, 범죄 및 소송 등을 위해 최소한의 개인정보 항목을 탈퇴자의 동의를 받고 보유할 수 있으며 기타 법령의
      규정에 따라 보존할 수 있습니다.
    </div>
    <div>
      <p>(1) 관련법령에 의한 정보보유 사유</p>
      <p>① 『전자상거래 등에서의 소비자 보호에 관한 법률』에 따른 표시·광고, 계약내용 및 이행 거래에 관한 기록</p>
      <ul>
        <li>- 표시·광고에 관한 기록 : 6개월</li>
        <li>- 계약 또는 청약철회 등에 관한 기록 : 5년</li>
        <li>- 계약 또는 청약철회, 대금결제, 재화 등의 공급에 관한 기록 : 5년</li>
        <li>- 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년</li>
      </ul>
    </div>
    <div>
      <p>② 『통신비밀보호법』에 따른 통신사실확인자료 보관</p>
      <ul>
        <li>- 가입자 전기통신일시, 개시·종료기간, 상대방 가입자번호, 사용도수, 발신기지국 위치추적자료 : 1년</li>
        <li>- 컴퓨터 통신, 인터넷 로그기록자료, 접속지 추적자료 : 1년</li>
        <li>- 본인 확인에 관한 기록 : 3개월</li>
      </ul>
    </div>
  </UiSection>
</template>

<style lang="scss">
@import url(@/assets/scss/pages/cs.scss);
</style>
